AccumulationRegisters/А_ВзаиморасчетыССотрудниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>А_ВзаиморасчетыССотрудниками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаPL</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_ФормыPL</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОрганизацияБухгалтерия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыССотрудниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыССотрудниками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаиморасчетовССотрудниками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаНачисленияУдержанияВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыНачисленияУдержанияВыплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУчетаНачислений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыУчетаНачисленийИУдержаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗарплатаКВыплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЗарплатаКВыплате</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаКВыплате</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЕдиновременноеПособиеЗаСчетФСС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПростойСотрудников</v8:Type>
						<v8:Type>cfg:DocumentRef.Отпуск</v8:Type>
						<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
						<v8:Type>cfg:DocumentRef.Премия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПерерасчетНДФЛ</v8:Type>
						<v8:Type>cfg:DocumentRef.Увольнение</v8:Type>
						<v8:Type>cfg:DocumentRef.Командировка</v8:Type>
						<v8:Type>cfg:DocumentRef.УвольнениеСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускПоУходуЗаРебенком</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеЗарплатыКВыплате</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУчетаНачислений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыУчетаНачисленийИУдержаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыОперацийПоЗарплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоЗарплате</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АлиментыПрочиеИсполнительныеЛисты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлиментыПрочиеИсполнительныеЛистыКонтрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозмещениеУщерба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВознаграждениеПлатежногоАгента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВознаграждениеПлатежногоАгентаКонтрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатыБывшимСотрудникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Депонирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДивидендыСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобровольныеВзносыВНПФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорАвторскогоЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорРаботыУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжегодныйОтпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжегодныйОтпускАвансом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжегодныйОтпускОценочныеОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжегодныйОтпускОценочныеОбязательстваИРезервы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжегодныйОтпускРезервы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияЕжегодногоОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияЕжегодногоОтпускаОценочныеОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияЗаЗадержкуЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальнаяПомощь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НатуральныйДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачисленоДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачисленоПроцентовПоЗайму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачисленоСдельноДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛДоначисленныйПоРезультатамПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛПередачаЗадолженностиВНалоговыйОрган</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛПрочиеРасчетыСПерсоналом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НФДЛДивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НФДЛДивидендыСотрудникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкаОбязательстваИФормированиеРезервов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЗаймов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаПогребение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Профвзносы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыПоЗайму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСПерсоналом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеУдержания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжегодныйОтпускОценочныеОбязательстваИРезервыБУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжегодныйОтпускОценочныеОбязательстваИРезервыНУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоСтрахованиюБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоСтрахованиюРаботодатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоСтрахованиюФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоСтрахованиюФССНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеДепонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдержаниеЗаОтпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдержаниеНеизрасходованныхПодотчетныхСумм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдержаниеПоПрочимОперациямСРаботниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФССНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеЕСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйСбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/А_ФормыPL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>А_ФормыPL</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Форма1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Форма2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

AccumulationRegisters/А_ВзаиморасчетыССотрудниками/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура ЗаполнитьОрганизацию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВзаиморасчетыССотрудниками.Регистратор КАК Ссылка,
	|	ВзаиморасчетыССотрудниками.Регистратор.Организация КАК Организация
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Регистратор.Дата, ГОД),
	|	ВзаиморасчетыССотрудниками.Регистратор.Организация,
	|	ВзаиморасчетыССотрудниками.Регистратор.Номер";
	
	ВыборкаРегистраторов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРегистраторов.Следующий() Цикл
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Значение = ВыборкаРегистраторов.Ссылка;
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.Организация = ВыборкаРегистраторов.Организация;
		КонецЦикла;	
		
		НаборЗаписей.Записать();
		
	КонецЦикла
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДвижений

// Заполняет движения регистра А_ВзаиморасчетыССотрудниками из документа
// Документ.ОтражениеЗарплатыВФинансовомУчете.
//
// Σ-инвариант (proved через test_vzs_ozfu_verify.py 2026-05-20):
//   |Σ signed А_ВзСС| per (Орг, Подр) per Регистратор =
//   |Σ signed ПАП(Статья=ОплатаТруда, Источник=ПустаяСсылка)| per Регистратор
//   (знаки противоположные: А_ВзСС = −ПАП, т.к. ПАП — пассивная статья ОТ,
//   а А_ВзСС хранит ПРЯМОЙ долг работодателя перед физлицом.)
//
// Источники (3 ТЧ документа) и финансистская семантика знаков (как в типовом
// РегистрНакопления.ВзаиморасчетыССотрудниками — начисление = ДобавитьПриход):
//   1) НачисленнаяЗарплатаИВзносыПоФизлицам где Налог=Пуст
//      И ВидОперации НЕ В 4 исключения → ВидДвижения=Приход (долг растёт)
//   2) НачисленныйНДФЛ                                       → ВидДвижения=Расход (списание в бюджет)
//   3) УдержаннаяЗарплата                                    → ВидДвижения=Расход (списание удержаний)
//
// Сальдо (Приход − Расход) = чистый долг работодателя перед ФЛ к выплате
// на руки (положительное = к выплате; отрицательное = переплата/возврат).
//
// Параметры:
//   ДокОбъект - ДокументОбъект.ОтражениеЗарплатыВФинансовомУчете
//
Процедура ЗаполнитьИзОтраженияЗП(ДокОбъект) Экспорт

	// Явно включаем запись регистра в текущем цикле проведения
	ДокОбъект.Движения.А_ВзаиморасчетыССотрудниками.Записывать = Истина;
	ДокОбъект.Движения.А_ВзаиморасчетыССотрудниками.Очистить();

	// Если документ не проведён — записываем пустой набор (очистка движений)
	Если НЕ ДокОбъект.Проведен Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("Орг", ДокОбъект.Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Н.Организация КАК Организация,
	|	Н.ПодразделениеПредприятия КАК Подразделение,
	|	Н.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Н.Сумма КАК Знач,
	|	Н.ФормаPL КАК ФормаPL,
	|	Н.ОрганизацияБухгалтерия КАК ОрганизацияБухгалтерия
	|ПОМЕСТИТЬ втСтроки
	|ИЗ
	|	Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленнаяЗарплатаИВзносыПоФизлицам КАК Н
	|ГДЕ
	|	Н.Ссылка = &Док
	|	И Н.Налог = ЗНАЧЕНИЕ(Справочник.Налоги.ПустаяСсылка)
	|	И НЕ Н.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НачисленоСдельноДоход), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Орг,
	|	НДФЛ.ПодразделениеПредприятия,
	|	НДФЛ.ФизическоеЛицо,
	|	-НДФЛ.Сумма,
	|	НДФЛ.ФормаPL,
	|	НДФЛ.ОрганизацияБухгалтерия
	|ИЗ
	|	Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленныйНДФЛ КАК НДФЛ
	|ГДЕ
	|	НДФЛ.Ссылка = &Док
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Орг,
	|	У.ПодразделениеПредприятия,
	|	У.ФизическоеЛицо,
	|	-У.Сумма,
	|	У.ФормаPL,
	|	У.ОрганизацияБухгалтерия
	|ИЗ
	|	Документ.ОтражениеЗарплатыВФинансовомУчете.УдержаннаяЗарплата КАК У
	|ГДЕ
	|	У.Ссылка = &Док
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	С.Организация КАК Организация,
	|	С.Подразделение КАК Подразделение,
	|	С.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА СУММА(С.Знач) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА СУММА(С.Знач) > 0
	|			ТОГДА СУММА(С.Знач)
	|		ИНАЧЕ -СУММА(С.Знач)
	|	КОНЕЦ КАК СуммаВзаиморасчетов,
	|	С.ФормаPL КАК ФормаPL,
	|	С.ОрганизацияБухгалтерия КАК ОрганизацияБухгалтерия
	|ИЗ
	|	втСтроки КАК С
	|
	|СГРУППИРОВАТЬ ПО
	|	С.Организация,
	|	С.Подразделение,
	|	С.ФизическоеЛицо,
	|	С.ФормаPL,
	|	С.ОрганизацияБухгалтерия
	|
	|ИМЕЮЩИЕ
	|	СУММА(С.Знач) <> 0";

	Результат = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрТЗ Из Результат Цикл
		Если СтрТЗ.СуммаВзаиморасчетов = 0 Тогда
			Продолжить;
		КонецЕсли;
		Запись = ДокОбъект.Движения.А_ВзаиморасчетыССотрудниками.Добавить();
		Запись.Период              = ДокОбъект.Дата;
		Запись.ФормаPL             = СтрТЗ.ФормаPL;
		Запись.Организация         = СтрТЗ.Организация; 
		Запись.ОрганизацияБухгалтерия         = СтрТЗ.ОрганизацияБухгалтерия;
		Запись.Подразделение       = СтрТЗ.Подразделение;
		Запись.ФизическоеЛицо      = СтрТЗ.ФизическоеЛицо;
		Запись.ВидДвижения         = СтрТЗ.ВидДвижения;
		Запись.СуммаВзаиморасчетов = СтрТЗ.СуммаВзаиморасчетов;
	КонецЦикла;

КонецПроцедуры

// Заполняет движения регистра А_ВзаиморасчетыССотрудниками из документа
// Документ.СписаниеБезналичныхДенежныхСредств (выплата зарплаты через банк).
//
// Σ-инвариант (proved test_vzs_sbds_pretest.py 2026-05-20, Δ=0,00 ₽ на № 19099):
//   |Σ signed А_ВзСС| per (Орг, Подр) per Регистратор =
//   |Σ signed ПАП(Статья=ОплатаТруда, Источник=ПустаяСсылка)| per Регистратор
//
// Цепочка распределения по ФизЛицу:
//   СБДС.РасшифровкаПлатежа.Ведомость → ВедомостьНаВыплатуЗарплатыВБанк
//   → РегистрНакопления.ЗарплатаКВыплате (Регистратор=Ведомость, ВидДв=Расход,
//     ФизическоеЛицо, СуммаКВыплате)
//
// Подразделение: из шапки документа СБДС (как в типовом запросе ПАП блок 1,
// line 3910 ManagerModule.bsl СБДС).
// ВидДвижения: Расход (финансистская семантика — выплата уменьшает долг
// работодателя перед физлицом, как в типовом ВзаиморасчетыССотрудниками
// выплата = ДобавитьРасход в ВзаиморасчетыССотрудникамиБазовый).
// Фильтр ХозОперации: ВыплатаЗарплатыПоЗарплатномуПроекту И ВыплатаЗарплатыНаЛицевыеСчета
// (1:1 типовой блок 1 на line 3921-3923).
//
// Параметры:
//   ДокОбъект - ДокументОбъект.СписаниеБезналичныхДенежныхСредств
//
Процедура ЗаполнитьИзСписанияБезнал(ДокОбъект) Экспорт

	ДокОбъект.Движения.А_ВзаиморасчетыССотрудниками.Записывать = Истина;
	ДокОбъект.Движения.А_ВзаиморасчетыССотрудниками.Очистить();

	Если НЕ ДокОбъект.Проведен Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Д.Организация КАК Организация,
	|	Д.Подразделение КАК Подразделение,
	|	Зар.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	СУММА(Зар.СуммаКВыплате) КАК СуммаВзаиморасчетов,
	|	Д.А_ОрганизацияБухгалтерия КАК ОрганизацияБухгалтерия
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств КАК Д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК РП
	|		ПО (РП.Ссылка = Д.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗарплатаКВыплате КАК Зар
	|		ПО (Зар.Регистратор = РП.Ведомость)
	|ГДЕ
	|	Д.Ссылка = &Док
	|	И Д.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета))
	|	И Д.ПроведеноБанком
	|	И Зар.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	Д.Организация,
	|	Д.Подразделение,
	|	Зар.ФизическоеЛицо,
	|	Д.А_ОрганизацияБухгалтерия
	|
	|ИМЕЮЩИЕ
	|	СУММА(Зар.СуммаКВыплате) <> 0";

	Результат = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрТЗ Из Результат Цикл
		Если СтрТЗ.СуммаВзаиморасчетов = 0 Тогда
			Продолжить;
		КонецЕсли;
		Запись = ДокОбъект.Движения.А_ВзаиморасчетыССотрудниками.Добавить();
		Запись.Период              = ДокОбъект.Дата;    
		Запись.ФормаPL             = Перечисления.А_ФормыPL.Форма1;
		Запись.Организация         = СтрТЗ.Организация;   
		Запись.ОрганизацияБухгалтерия         = СтрТЗ.ОрганизацияБухгалтерия;
		Запись.Подразделение       = СтрТЗ.Подразделение;
		Запись.ФизическоеЛицо      = СтрТЗ.ФизическоеЛицо;
		Запись.ВидДвижения         = СтрТЗ.ВидДвижения;
		Запись.СуммаВзаиморасчетов = СтрТЗ.СуммаВзаиморасчетов;
	КонецЦикла;

КонецПроцедуры

// Заполняет движения регистра А_ВзаиморасчетыССотрудниками из документа
// Документ.РасходныйКассовыйОрдер (выплата зарплаты через кассу).
//
// Σ-инвариант (proved test_vzs_rko_pretest.py 2026-05-20, Δ=0,00 ₽
// на № 000Ц-000284 та № 000Ц-000175):
//   |Σ signed А_ВзСС| per (Орг, Подр) per Регистратор =
//   |Σ signed ПАП(Статья=ОплатаТруда, Источник=ПустаяСсылка)| per Регистратор
//
// Источник ФизЛица: ТЧ Документ.РасходныйКассовыйОрдер.ВыплатаЗаработнойПлаты
// (прямое поле ФизическоеЛицо + Сумма — заполняется автоматически при
// проведении документа по Ведомости в кассу).
//
// Подразделение: из шапки документа РКО (как и в типовом ПАП блок 1,
// line 3042 ManagerModule.bsl РКО — там Подразделение = НЕОПРЕДЕЛЕНО,
// но мы берём из шапки для drill-down, инвариант сходится).
// ВидДвижения: Расход (выплата уменьшает долг работодателя перед ФЛ).
// Фильтр ХозОперации: ВыплатаЗарплатыЧерезКассу/Раздатчиком/Работнику
// (1:1 типовой блок 1 на line 3052-3054 ManagerModule.bsl РКО).
//
// Параметры:
//   ДокОбъект - ДокументОбъект.РасходныйКассовыйОрдер
//
Процедура ЗаполнитьИзРКО(ДокОбъект) Экспорт

	ДокОбъект.Движения.А_ВзаиморасчетыССотрудниками.Записывать = Истина;
	ДокОбъект.Движения.А_ВзаиморасчетыССотрудниками.Очистить();

	Если НЕ ДокОбъект.Проведен Тогда
		Возврат;
	КонецЕсли;

	// Развилка: если РКО.Ведомость = наша ВКассу → берём из её А_Расшифровки
	// (закрытие в разрезе подразделений через Рш.Подразделение.А_Подразделение → СтрПредпр).
	// Иначе → старая логика (ТЧ.ВыплатаЗаработнойПлаты + 3 хозоперации).
	ЭтоНашаВКассу = Ложь;
	Если ЗначениеЗаполнено(ДокОбъект.Ведомость) Тогда
		Попытка
			ЭтоНашаВКассу = (ТипЗнч(ДокОбъект.Ведомость) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВКассу"));
		Исключение
			ЭтоНашаВКассу = Ложь;
		КонецПопытки;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);

	Если ЭтоНашаВКассу Тогда
		// НОВАЯ логика: источник = ВКассу.А_РасшифровкаВыплатыЗарплатаПоФизлицам.
		// Подразделение в строке регистра = ПодрОрг.А_Подразделение (СтрПредпр).
		// Шапочное Подр РКО игнорируется — берём реальное из каждой строки расшифровки.
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Д.Организация КАК Организация,
		|	Рш.Подразделение.А_Подразделение КАК Подразделение,
		|	Рш.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	СУММА(Рш.КВыплате) КАК СуммаВзаиморасчетов
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК Д
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыплатуЗарплатыВКассу.А_РасшифровкаВыплатыЗарплатаПоФизлицам КАК Рш
		|			ПО Рш.Ссылка = Д.Ведомость
		|ГДЕ
		|	Д.Ссылка = &Док
		|	И (Д.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыРаботнику)
		|		ИЛИ Рш.ФизическоеЛицо = Д.ПодотчетноеЛицо)
		|СГРУППИРОВАТЬ ПО
		|	Д.Организация, Рш.Подразделение.А_Подразделение, Рш.ФизическоеЛицо
		|ИМЕЮЩИЕ СУММА(Рш.КВыплате) <> 0";
	Иначе
		// СТАРАЯ логика (ТЧ.ВыплатаЗаработнойПлаты, 3 хозоперации) — без изменений
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Д.Организация КАК Организация,
		|	Д.Подразделение КАК Подразделение,
		|	ТЧ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	СУММА(ТЧ.Сумма) КАК СуммаВзаиморасчетов
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК Д
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер.ВыплатаЗаработнойПлаты КАК ТЧ
		|			ПО ТЧ.Ссылка = Д.Ссылка
		|	ГДЕ
		|	Д.Ссылка = &Док
		|	И Д.ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыРаздатчиком),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыРаботнику))
		|	СГРУППИРОВАТЬ ПО
		|	Д.Организация, Д.Подразделение, ТЧ.ФизическоеЛицо
		|	ИМЕЮЩИЕ СУММА(ТЧ.Сумма) <> 0";
	КонецЕсли;

	Результат = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрТЗ Из Результат Цикл
		Если СтрТЗ.СуммаВзаиморасчетов = 0 Тогда
			Продолжить;
		КонецЕсли;
		Запись = ДокОбъект.Движения.А_ВзаиморасчетыССотрудниками.Добавить();
		Запись.Период              = ДокОбъект.Дата;  
		Запись.ФормаPL             = Перечисления.А_ФормыPL.Форма2;
		Запись.Организация         = СтрТЗ.Организация;   

		Запись.Подразделение       = СтрТЗ.Подразделение;
		Запись.ФизическоеЛицо      = СтрТЗ.ФизическоеЛицо;
		Запись.ВидДвижения         = СтрТЗ.ВидДвижения;
		Запись.СуммаВзаиморасчетов = СтрТЗ.СуммаВзаиморасчетов;
	КонецЦикла;

КонецПроцедуры

// Заполняет движения А_ВзаиморасчетыССотрудниками из
// Документ.А_ПередачаНачисленийМеждуПодразделениями (межподразделенческая передача ЗП).
//
// ТЧ Начисления хранит NET per (ФЛ, ИсходноеПодразделение, ЦелевоеПодразделение).
// Долг работодателя перед ФЛ «перебрасывается»: на ИсходномПодразделении гасится
// (обратный знак к начислению ОЗФУ → Расход для положительного NET), на
// ЦелевомПодразделении ставится (Приход). Знак инверсен ПАП(Оплата труда), как и у
// остальных регистраторов — А_ВзСС хранит ПРЯМОЙ долг (Приход = рост долга перед ФЛ).
//
// Σ-инвариант: после ОЗФУ(+новый документ) Σ А_ВзСС per (Орг,Подр,ФЛ) на исходном
// обнуляется на перенесённую долю, на целевом появляется — net-zero по организации.
//
// Параметры:
//   ДокОбъект - ДокументОбъект.А_ПередачаНачисленийМеждуПодразделениями
//
Процедура ЗаполнитьИзПередачиНачислений(ДокОбъект) Экспорт

	ДокОбъект.Движения.А_ВзаиморасчетыССотрудниками.Записывать = Истина;
	ДокОбъект.Движения.А_ВзаиморасчетыССотрудниками.Очистить();

	Если НЕ ДокОбъект.Проведен Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("Орг", ДокОбъект.Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Н.ИсходноеПодразделение КАК Подразделение,
	|	Н.ФизическоеЛицо КАК ФизическоеЛицо,
	|	-Н.Сумма КАК Знач,
	|	Н.ОрганизацияБухгалтерия КАК ОрганизацияБухгалтерия,
	|	Н.ФормаPL КАК ФормаPL
	|ПОМЕСТИТЬ втСтроки
	|ИЗ
	|	Документ.А_ПередачаНачисленийМеждуПодразделениями.Начисления КАК Н
	|ГДЕ
	|	Н.Ссылка = &Док
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Н.ЦелевоеПодразделение,
	|	Н.ФизическоеЛицо,
	|	Н.Сумма,
	|	Н.ОрганизацияБухгалтерия,
	|	Н.ФормаPL
	|ИЗ
	|	Документ.А_ПередачаНачисленийМеждуПодразделениями.Начисления КАК Н
	|ГДЕ
	|	Н.Ссылка = &Док
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Орг КАК Организация,
	|	С.Подразделение КАК Подразделение,
	|	С.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА СУММА(С.Знач) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА СУММА(С.Знач) > 0
	|			ТОГДА СУММА(С.Знач)
	|		ИНАЧЕ -СУММА(С.Знач)
	|	КОНЕЦ КАК СуммаВзаиморасчетов,
	|	С.ОрганизацияБухгалтерия КАК ОрганизацияБухгалтерия,
	|	С.ФормаPL КАК ФормаPL
	|ИЗ
	|	втСтроки КАК С
	|
	|СГРУППИРОВАТЬ ПО
	|	С.Подразделение,
	|	С.ФизическоеЛицо,
	|	С.ОрганизацияБухгалтерия,
	|	С.ФормаPL
	|
	|ИМЕЮЩИЕ
	|	СУММА(С.Знач) <> 0";

	Результат = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрТЗ Из Результат Цикл
		Если СтрТЗ.СуммаВзаиморасчетов = 0 Тогда
			Продолжить;
		КонецЕсли;
		Запись = ДокОбъект.Движения.А_ВзаиморасчетыССотрудниками.Добавить();
		Запись.Период              = ДокОбъект.Дата;
		Запись.ФормаPL             = СтрТЗ.ФормаPL;
		Запись.Организация         = СтрТЗ.Организация; 
		Запись.ОрганизацияБухгалтерия         = СтрТЗ.ОрганизацияБухгалтерия;
		Запись.Подразделение       = СтрТЗ.Подразделение;
		Запись.ФизическоеЛицо      = СтрТЗ.ФизическоеЛицо;
		Запись.ВидДвижения         = СтрТЗ.ВидДвижения;
		Запись.СуммаВзаиморасчетов = СтрТЗ.СуммаВзаиморасчетов;
	КонецЦикла;

КонецПроцедуры

// Заполняет движения А_ВзаиморасчетыССотрудниками из
// Документ.НачальнаяЗадолженностьПоЗарплате (ввод входящего остатка долга по ЗП).
//
// Источник истины — собственная ТЧ ЗадолженностьПоЗарплате (Сумма per Сотрудник ×
// Подразделение × ФормаPL × ОрганизацияБухгалтерия). Документ НЕ пишет ПрочиеАктивыПассивы,
// поэтому Σ-инвариант self-contained (vs ТЧ документа), а НЕ vs ПАП(ОплатаТруда) как у
// остальных регистраторов:
//   Σ signed А_ВзСС per (Орг,Подр,ФЛ,Форма,ОргБух) per Регистратор = Σ ТЧ.Сумма per тот же ключ.
//
// Знак (как в типовом ВзаиморасчетыССотрудниками — начисление = ДобавитьПриход):
//   Сумма > 0 (прямой долг работодателя перед ФЛ) → ВидДвижения = Приход (долг растёт);
//   Сумма < 0 (переплата) → ВидДвижения = Расход.
//
// Конверсии: Сотрудник.ФизическоеЛицо; Подразделение(ПодрОрг).А_Подразделение → СтрПредпр;
//   ФормаPL пусто → Форма1 (начальная задолженность = официальная).
//
// Период = Месяц (период остатка), НЕ Дата: у документа ввода остатков Дата (тех.дата ввода)
// и Месяц расходятся (эталон Дата=2026-11-30 / Месяц=2025-11-01); типовое проведение пишет
// ВзаиморасчетыССотрудниками с периодом=Месяц, наш регистр обязан совпадать по периоду
// (RecordSetModule нормализует период до НачалоМесяца).
//
// Параметры:
//   ДокОбъект - ДокументОбъект.НачальнаяЗадолженностьПоЗарплате
//
Процедура ЗаполнитьИзНачальнойЗадолженности(ДокОбъект) Экспорт

	ДокОбъект.Движения.А_ВзаиморасчетыССотрудниками.Записывать = Истина;
	ДокОбъект.Движения.А_ВзаиморасчетыССотрудниками.Очистить();

	Если НЕ ДокОбъект.Проведен Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("Орг", ДокОбъект.Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Орг КАК Организация,
	|	З.Подразделение.А_Подразделение КАК Подразделение,
	|	З.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА З.ФормаPL = ЗНАЧЕНИЕ(Перечисление.А_ФормыPL.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.А_ФормыPL.Форма1)
	|		ИНАЧЕ З.ФормаPL
	|	КОНЕЦ КАК ФормаPL,
	|	З.ОрганизацияБухгалтерия КАК ОрганизацияБухгалтерия,
	|	З.Сумма КАК Знач
	|ПОМЕСТИТЬ втСтроки
	|ИЗ
	|	Документ.НачальнаяЗадолженностьПоЗарплате.ЗадолженностьПоЗарплате КАК З
	|ГДЕ
	|	З.Ссылка = &Док
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	С.Организация КАК Организация,
	|	С.Подразделение КАК Подразделение,
	|	С.ФизическоеЛицо КАК ФизическоеЛицо,
	|	С.ФормаPL КАК ФормаPL,
	|	С.ОрганизацияБухгалтерия КАК ОрганизацияБухгалтерия,
	|	ВЫБОР
	|		КОГДА СУММА(С.Знач) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА СУММА(С.Знач) > 0
	|			ТОГДА СУММА(С.Знач)
	|		ИНАЧЕ -СУММА(С.Знач)
	|	КОНЕЦ КАК СуммаВзаиморасчетов
	|ИЗ
	|	втСтроки КАК С
	|СГРУППИРОВАТЬ ПО
	|	С.Организация,
	|	С.Подразделение,
	|	С.ФизическоеЛицо,
	|	С.ФормаPL,
	|	С.ОрганизацияБухгалтерия
	|ИМЕЮЩИЕ
	|	СУММА(С.Знач) <> 0";

	Результат = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрТЗ Из Результат Цикл
		Если СтрТЗ.СуммаВзаиморасчетов = 0 Тогда
			Продолжить;
		КонецЕсли;
		Запись = ДокОбъект.Движения.А_ВзаиморасчетыССотрудниками.Добавить();
		Запись.Период                 = ДокОбъект.Месяц;
		Запись.Организация            = СтрТЗ.Организация;
		Запись.ФормаPL                = СтрТЗ.ФормаPL;
		Запись.Подразделение          = СтрТЗ.Подразделение;
		Запись.ФизическоеЛицо         = СтрТЗ.ФизическоеЛицо;
		Запись.ОрганизацияБухгалтерия = СтрТЗ.ОрганизацияБухгалтерия;
		Запись.ВидДвижения            = СтрТЗ.ВидДвижения;
		Запись.СуммаВзаиморасчетов    = СтрТЗ.СуммаВзаиморасчетов;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
